# 7.1 Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

Table 7-1. NA handling methods

Argument Description
dropna Filter axis labels based on whether values for each label have missing data, with varying thresholds for how
much missing data to tolerate.
fillna Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'.
isnull Return boolean values indicating which values are missing/NA.
notnull Negation of isnull.

## Filtering Out Missing Data

In [6]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

This is equivalent to:

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

dropna by default drops
any row containing a missing value:

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [9]:
cleaned = data.dropna()

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

Passing how='all' will only drop rows that are all NA:

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

To drop columns in the same way, pass axis=1:

In [14]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
 data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df.iloc[4,0]=NA

In [27]:
df

          0         1         2
0 -0.644339       NaN       NaN
1 -0.034038       NaN       NaN
2  0.370992       NaN -1.334312
3 -2.812692       NaN -0.104191
4       NaN -0.769966 -1.455126
5 -0.803549  0.001159  0.312396
6 -0.444874  1.057901 -1.404798

In [28]:
df.dropna()

          0         1         2
5 -0.803549  0.001159  0.312396
6 -0.444874  1.057901 -1.404798

In [29]:
df.dropna(thresh=2)

          0         1         2
2  0.370992       NaN -1.334312
3 -2.812692       NaN -0.104191
4       NaN -0.769966 -1.455126
5 -0.803549  0.001159  0.312396
6 -0.444874  1.057901 -1.404798

## Filling In Missing Data

In [30]:
df.fillna(0)

          0         1         2
0 -0.644339  0.000000  0.000000
1 -0.034038  0.000000  0.000000
2  0.370992  0.000000 -1.334312
3 -2.812692  0.000000 -0.104191
4  0.000000 -0.769966 -1.455126
5 -0.803549  0.001159  0.312396
6 -0.444874  1.057901 -1.404798

Calling fillna with a dict, you can use a different fill value for each column:

In [32]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.644339  0.500000  0.000000
1 -0.034038  0.500000  0.000000
2  0.370992  0.500000 -1.334312
3 -2.812692  0.500000 -0.104191
4       NaN -0.769966 -1.455126
5 -0.803549  0.001159  0.312396
6 -0.444874  1.057901 -1.404798

fillna returns a new object, but you can modify the existing object in-place:

In [33]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.644339  0.000000  0.000000
1 -0.034038  0.000000  0.000000
2  0.370992  0.000000 -1.334312
3 -2.812692  0.000000 -0.104191
4  0.000000 -0.769966 -1.455126
5 -0.803549  0.001159  0.312396
6 -0.444874  1.057901 -1.404798

In [34]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.554153  0.166546  1.420293
1 -0.493907  0.385936  0.954274
2 -0.867196       NaN  1.074324
3  0.872394       NaN -0.889060
4 -0.431769       NaN       NaN
5  0.368797       NaN       NaN

In [35]:
df.fillna(method='ffill')

          0         1         2
0 -0.554153  0.166546  1.420293
1 -0.493907  0.385936  0.954274
2 -0.867196  0.385936  1.074324
3  0.872394  0.385936 -0.889060
4 -0.431769  0.385936 -0.889060
5  0.368797  0.385936 -0.889060

In [36]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.554153  0.166546  1.420293
1 -0.493907  0.385936  0.954274
2 -0.867196  0.385936  1.074324
3  0.872394  0.385936 -0.889060
4 -0.431769       NaN -0.889060
5  0.368797       NaN -0.889060

In [38]:
df.iloc[5,1]=25

In [40]:
df.fillna(method='bfill')

          0          1         2
0 -0.554153   0.166546  1.420293
1 -0.493907   0.385936  0.954274
2 -0.867196  25.000000  1.074324
3  0.872394  25.000000 -0.889060
4 -0.431769  25.000000       NaN
5  0.368797  25.000000       NaN

With fillna you can do lots of other things with a little creativity. For example, you
might pass the mean or median value of a Series:

In [41]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [42]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Table 7-2. fillna function arguments
Argument Description
value Scalar value or dict-like object to use to fill missing values
method Interpolation; by default 'ffill' if function called with no other arguments
axis Axis to fill on; default axis=0
inplace Modify the calling object without producing a copy
limit For forward and backward filling, maximum number of consecutive periods to fill

## 7.2 Data Transformation

In [43]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The DataFrame method duplicated returns a boolean Series indicating whether each
row is a duplicate (has been observed in a previous row) or not:

In [44]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

Relatedly, drop_duplicates returns a DataFrame where the duplicated array is
False:

In [45]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [46]:
data['v1'] = range(7)

In [47]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [48]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [49]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [50]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [51]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [52]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [53]:
lowercased = data['food'].str.lower()

In [54]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [55]:
data['animal'] = lowercased.map(meat_to_animal)

In [56]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

We could also have passed a function that does all the work

In [58]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Replacing Values

In [59]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

If you want to replace multiple values at once, you instead pass a list and then the
substitute value:

In [61]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [62]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [63]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [64]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [65]:
transform = lambda x: x[:4].upper()

In [66]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [67]:
data.index = data.index.map(transform)

In [68]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [69]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [70]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [71]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [72]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [73]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

Discretization and Binning

In [74]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Lets divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
do so, you have to use cut, a function in pandas:

In [76]:
 bins = [18, 25, 35, 60, 100]

In [77]:
cats = pd.cut(ages, bins)

In [78]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [79]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [80]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [81]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

 a parenthesis means that the side
is open, while the square bracket means it is closed (inclusive)
You can change which
side is closed by passing right=False:

In [82]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

You can also pass your own bin names by passing a list or array to the labels option:

In [83]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [84]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [85]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.056, 0.26], (0.056, 0.26], (0.67, 0.87], (0.67, 0.87], (0.47, 0.67], ..., (0.056, 0.26], (0.67, 0.87], (0.26, 0.47], (0.26, 0.47], (0.26, 0.47]]
Length: 20
Categories (4, interval[float64]): [(0.056, 0.26] < (0.26, 0.47] < (0.47, 0.67] < (0.67, 0.87]]

A closely related function, qcut, bins the data based on sample quantiles. Depending
on the distribution of the data, using cut will not usually result in each bin having the
same number of data points. Since qcut uses sample quantiles instead, by definition
you will obtain roughly equal-size bins:

In [86]:
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(0.629, 2.897], (-3.3289999999999997, -0.688], (0.629, 2.897], (-3.3289999999999997, -0.688], (-0.688, -0.0262], ..., (-0.0262, 0.629], (0.629, 2.897], (0.629, 2.897], (-0.688, -0.0262], (-0.0262, 0.629]]
Length: 1000
Categories (4, interval[float64]): [(-3.3289999999999997, -0.688] < (-0.688, -0.0262] < (-0.0262, 0.629] < (0.629, 2.897]]

In [87]:
pd.value_counts(cats)

(0.629, 2.897]                   250
(-0.0262, 0.629]                 250
(-0.688, -0.0262]                250
(-3.3289999999999997, -0.688]    250
dtype: int64

Similar to cut you can pass your own quantiles (numbers between 0 and 1, inclusive):

In [90]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0262, 1.331], (-3.3289999999999997, -1.253], (-0.0262, 1.331], (-1.253, -0.0262], (-1.253, -0.0262], ..., (-0.0262, 1.331], (1.331, 2.897], (-0.0262, 1.331], (-1.253, -0.0262], (-0.0262, 1.331]]
Length: 1000
Categories (4, interval[float64]): [(-3.3289999999999997, -1.253] < (-1.253, -0.0262] < (-0.0262, 1.331] < (1.331, 2.897]]

# Detecting and Filtering Outliers

In [91]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.016443     0.008389     0.014758     0.000418
std       0.976822     1.042102     1.028640     1.040493
min      -4.084953    -3.504468    -2.924246    -3.132266
25%      -0.629016    -0.675541    -0.725794    -0.721085
50%       0.031452     0.024488    -0.015498     0.029978
75%       0.717586     0.716821     0.726077     0.744467
max       2.537010     2.837777     3.156303     3.059882

In [92]:
col = data[2]

In [93]:
col[np.abs(col) > 3]

441    3.156303
575    3.097973
Name: 2, dtype: float64

In [94]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
260  0.206509 -3.032660  1.132570  0.803509
286  0.024453 -0.580146  0.505615  3.059882
341  0.312614  1.174624 -0.172120 -3.132266
356 -3.134224 -0.460057  0.165001  0.305968
441 -0.586376 -0.334109  3.156303  0.113763
468 -0.320799 -3.146743  0.647841  0.981783
474  1.066566  1.413976  0.682799  3.045580
575 -0.317420  1.405110  3.097973 -0.043329
717 -3.090112  0.856598 -0.871009 -1.633342
781 -4.084953  0.719011  0.691747  0.480400
896  1.834118 -3.504468 -1.587745  1.636607

In [95]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [96]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017752     0.009073     0.014504     0.000445
std       0.972146     1.039990     1.027885     1.039795
min      -3.000000    -3.000000    -2.924246    -3.000000
25%      -0.629016    -0.675541    -0.725794    -0.721085
50%       0.031452     0.024488    -0.015498     0.029978
75%       0.717586     0.716821     0.726077     0.744467
max       2.537010     2.837777     3.000000     3.000000

The statement np.sign(data) produces 1 and 1 values based on whether the values
in data are positive or negative:

In [97]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0  1.0
1  1.0  1.0 -1.0  1.0
2  1.0 -1.0  1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4 -1.0  1.0  1.0  1.0

# Permutation and Random Sampling

Permuting (randomly reordering) a Series or the rows in a DataFrame is easy to do
using the numpy.random.permutation function

In [98]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [99]:
sampler = np.random.permutation(5)

In [100]:
sampler

array([2, 1, 0, 3, 4])

In [101]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

That array can then be used in iloc-based indexing or the equivalent take function:

In [102]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [103]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

To select a random subset without replacement, you can use the sample method on
Series and DataFrame:

In [105]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

In [106]:
choices = pd.Series([5, 7, -1, 6, 4])

In [107]:
draws = choices.sample(n=10, replace=True)

In [108]:
draws

4    4
4    4
2   -1
4    4
4    4
1    7
4    4
3    6
4    4
3    6
dtype: int64

# Computing Indicator/Dummy Variables

In [109]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [111]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In some cases, you may want to add a prefix to the columns in the indicator Data
Frame, which can then be merged with the other data. get_dummies has a prefix argu
ment for doing this:

In [112]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [116]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cat = pd.cut(ages, bins)

In [117]:
cat

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [118]:
cat.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [119]:
data = np.random.rand(20)
data

array([0.20998301, 0.94225707, 0.86340955, 0.81938229, 0.42974211,
       0.68796972, 0.85115763, 0.78584928, 0.66644053, 0.85299672,
       0.30939397, 0.30023381, 0.70647501, 0.25599457, 0.89675782,
       0.12799684, 0.33499604, 0.95558335, 0.96454916, 0.05432658])

In [120]:
pd.cut(data, 4, precision=2)

[(0.053, 0.28], (0.74, 0.96], (0.74, 0.96], (0.74, 0.96], (0.28, 0.51], ..., (0.053, 0.28], (0.28, 0.51], (0.74, 0.96], (0.74, 0.96], (0.053, 0.28]]
Length: 20
Categories (4, interval[float64]): [(0.053, 0.28] < (0.28, 0.51] < (0.51, 0.74] < (0.74, 0.96]]

In [121]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.202, 0.697], (0.697, 0.944], (0.697, 0.944], (0.697, 0.944], (0.202, 0.697], ..., (0.0533, 0.202], (0.202, 0.697], (0.944, 0.965], (0.944, 0.965], (0.0533, 0.202]]
Length: 20
Categories (4, interval[float64]): [(0.0533, 0.202] < (0.202, 0.697] < (0.697, 0.944] < (0.944, 0.965]]

In [126]:
pd.value_counts(pd.qcut(data, [0,0.1,0.3, 0.5, 0.9, 1.]))

(0.697, 0.944]     8
(0.327, 0.697]     4
(0.202, 0.327]     4
(0.944, 0.965]     2
(0.0533, 0.202]    2
dtype: int64

In [129]:
data

array([0.20998301, 0.94225707, 0.86340955, 0.81938229, 0.42974211,
       0.68796972, 0.85115763, 0.78584928, 0.66644053, 0.85299672,
       0.30939397, 0.30023381, 0.70647501, 0.25599457, 0.89675782,
       0.12799684, 0.33499604, 0.95558335, 0.96454916, 0.05432658])

In [130]:
np.sign??